backend/app/controllers/notes_controller.rb

  def create
    note = Note.create(note_params)
---
INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "oyo"], ["body", "a new body"], ["created_at", "2021-07-23 11:12:23.334007"], ["updated_at", "2021-07-23 11:12:23.334007"]]

  def destroy
    note = Note.find_by_id(params[:id])
    note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 2]]