backend/app/controllers/tags_controller.rb

  def create
    tag = Tag.create(name: tag_params[:note]);
    note = Note.find_by_id(tag_params[:note_id])
    tag.notes << note
---
INSERT INTO "tag_notes" ("note_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["note_id", 1], ["tag_id", 13], ["created_at", "2021-07-25 13:20:40.694897"], ["updated_at", "2021-07-25 13:20:40.694897"]]
INSERT INTO "tags" ("name", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "it works again"], ["note_id", 1], ["created_at", "2021-07-26 09:21:29.940261"], ["updated_at", "2021-07-26 09:21:29.940261"]]
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "boo!"], ["note_id", 1], ["created_at", "2021-07-26 08:06:01.702539"], ["updated_at", "2021-07-26 08:06:01.702539"]]

  def destroy
    tag = Tag.find_by_id(params[:id])
    tag.destroy
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 13]]